
   #### Read each of the files in the list data_files into a pandas dataframe using the pandas.read_csv() function.
   ####     Recall that all of the data sets are in the schools folder. That means the path to ap_2010.csv is schools/ap_2010.csv.
   #### Add each of the dataframes to the dictionary data, using the base of the filename as the key. For example, you'd enter ap_2010 for the file ap_2010.csv.
  ####  Afterwards, data should have the following keys:
   ####   ap_2010
  ####     class_size
  ####    demographics
 ####     graduation
####       hs_directory
 ####      sat_results
 ####  In addition, each key in data should have the corresponding dataframe as its value.

In [1]:
# import libraries
import pandas as pd

# create a list of the dataset files
data_files = [
    "ap_2010.csv",
    "class_size.csv",
    "demographics.csv",
    "graduation.csv",
    "hs_directory.csv",
    "sat_results.csv"
]
# create an empty dictionary
data = {}

# Read the data_files list into dataframes and add them to the dictionary
for f in data_files:
    d =  pd.read_csv("C:/Users/STELLAS MFB IT/Desktop/p/schools/{0}".format(f))
    key_name = f.replace(".csv","")
    data[key_name] = d

#### Display the first five rows of the SAT scores data.

####  Use the key sat_results to access the SAT scores dataframe stored in the dictionary data.
####   Use the pandas.DataFrame.head() method  to display the first five rows of the dataframe.

In [2]:
# Display 5 rows of sat resullts from dictionary data
data["sat_results"].head()

,DBN,SCHOOL NAME,Num of SAT Test Takers,SAT Critical Reading Avg. Score,SAT Math Avg. Score,SAT Writing Avg. Score
0,01M292,HENRY STREET SCHOOL FOR INTERNATIONAL STUDIES,29,355,404,363
1,01M448,UNIVERSITY NEIGHBORHOOD HIGH SCHOOL,91,383,423,366
2,01M450,EAST SIDE COMMUNITY SCHOOL,70,377,402,370
3,01M458,FORSYTH SATELLITE ACADEMY,7,414,401,359
4,01M509,MARTA VALLE HIGH SCHOOL,44,390,433,384

#### Loop through each key in data. For each key:

####  Display the first five rows of the dataframe associated with the key.

In [3]:
for key in data:
    print(data[key].head())

      DBN                             SchoolName  AP Test Takers   \
0  01M448           UNIVERSITY NEIGHBORHOOD H.S.             39.0
1  01M450                 EAST SIDE COMMUNITY HS             19.0
2  01M515                    LOWER EASTSIDE PREP             24.0
3  01M539         NEW EXPLORATIONS SCI,TECH,MATH            255.0
4  02M296  High School of Hospitality Management              NaN

   Total Exams Taken  Number of Exams with scores 3 4 or 5
0               49.0                                  10.0
1               21.0                                   NaN
2               26.0                                  24.0
3              377.0                                 191.0
4                NaN                                   NaN
   CSD BOROUGH SCHOOL CODE                SCHOOL NAME GRADE  PROGRAM TYPE  \
0    1       M        M015  P.S. 015 Roberto Clemente     0K       GEN ED
1    1       M        M015  P.S. 015 Roberto Clemente     0K          CTT
2    1       M        M015  P.S. 015 Roberto Clemente     01       GEN ED
3    1       M        M015  P.S. 015 Roberto Clemente     01          CTT
4    1       M        M015  P.S. 015 Roberto Clemente     02       GEN ED

  CORE SUBJECT (MS CORE and 9-12 ONLY) CORE COURSE (MS CORE and 9-12 ONLY)  \
0                                    -                                   -
1                                    -                                   -
2                                    -                                   -
3                                    -                                   -
4                                    -                                   -

  SERVICE CATEGORY(K-9* ONLY)  NUMBER OF STUDENTS / SEATS FILLED  \
0                           -                               19.0
1                           -                               21.0
2                           -                               17.0
3                           -                               17.0
4                           -                               15.0

   NUMBER OF SECTIONS  AVERAGE CLASS SIZE  SIZE OF SMALLEST CLASS  \
0                 1.0                19.0                    19.0
1                 1.0                21.0                    21.0
2                 1.0                17.0                    17.0
3                 1.0                17.0                    17.0
4                 1.0                15.0                    15.0

   SIZE OF LARGEST CLASS DATA SOURCE  SCHOOLWIDE PUPIL-TEACHER RATIO
0                   19.0         ATS                             NaN
1                   21.0         ATS                             NaN
2                   17.0         ATS                             NaN
3                   17.0         ATS                             NaN
4                   15.0         ATS                             NaN
      DBN                       Name  schoolyear fl_percent  frl_percent  \
0  01M015  P.S. 015 ROBERTO CLEMENTE    20052006       89.4          NaN
1  01M015  P.S. 015 ROBERTO CLEMENTE    20062007       89.4          NaN
2  01M015  P.S. 015 ROBERTO CLEMENTE    20072008       89.4          NaN
3  01M015  P.S. 015 ROBERTO CLEMENTE    20082009       89.4          NaN
4  01M015  P.S. 015 ROBERTO CLEMENTE    20092010                    96.5

   total_enrollment prek   k grade1 grade2  ... black_num black_per  \
0               281   15  36     40     33  ...        74      26.3
1               243   15  29     39     38  ...        68      28.0
2               261   18  43     39     36  ...        77      29.5
3               252   17  37     44     32  ...        75      29.8
4               208   16  40     28     32  ...        67      32.2

  hispanic_num hispanic_per white_num white_per male_num male_per female_num  \
0          189         67.3         5       1.8    158.0     56.2      123.0
1          153         63.0         4       1.6    140.0     57.6      103.0
2          157         60.2         7       2.7    143.0     54.8      118.0
3          149         59.1         7       2.8    149.0     59.1      103.0
4          118         56.7         6       2.9    124.0     59.6       84.0

  female_per
0       43.8
1       42.4
2       45.2
3       40.9
4       40.4

[5 rows x 38 columns]
    Demographic     DBN                            School Name    Cohort  \
0  Total Cohort  01M292  HENRY STREET SCHOOL FOR INTERNATIONAL      2003
1  Total Cohort  01M292  HENRY STREET SCHOOL FOR INTERNATIONAL      2004
2  Total Cohort  01M292  HENRY STREET SCHOOL FOR INTERNATIONAL      2005
3  Total Cohort  01M292  HENRY STREET SCHOOL FOR INTERNATIONAL      2006
4  Total Cohort  01M292  HENRY STREET SCHOOL FOR INTERNATIONAL  2006 Aug

   Total Cohort Total Grads - n  Total Grads - % of cohort Total Regents - n  \
0             5               s                        NaN                 s
1            55              37                       67.3                17
2            64              43                       67.2                27
3            78              43                       55.1                36
4            78              44                       56.4                37

   Total Regents - % of cohort  Total Regents - % of grads  ...  \
0                          NaN                         NaN  ...
1                         30.9                        45.9  ...
2                         42.2                        62.8  ...
3                         46.2                        83.7  ...
4                         47.4                        84.1  ...

  Regents w/o Advanced - n  Regents w/o Advanced - % of cohort  \
0                        s                                 NaN
1                       17                                30.9
2                       27                                42.2
3                       36                                46.2
4                       37                                47.4

   Regents w/o Advanced - % of grads Local - n  Local - % of cohort  \
0                                NaN         s                  NaN
1                               45.9        20                 36.4
2                               62.8        16                 25.0
3                               83.7         7                  9.0
4                               84.1         7                  9.0

   Local - % of grads Still Enrolled - n  Still Enrolled - % of cohort  \
0                 NaN                  s                           NaN
1                54.1                 15                          27.3
2                37.2                  9                          14.1
3                16.3                 16                          20.5
4                15.9                 15                          19.2

   Dropped Out - n Dropped Out - % of cohort
0                s                       NaN
1                3                       5.5
2                9                      14.1
3               11                      14.1
4               11                      14.1

[5 rows x 23 columns]
      dbn                                        school_name    borough  \
0  21K540                             John Dewey High School   Brooklyn
1  15K429                 Brooklyn School for Global Studies   Brooklyn
2  24Q530  International High School at LaGuardia Communi...     Queens
3  05M367  Academy for Social Action: A College Board School  Manhattan
4  27Q260          Frederick Douglass Academy VI High School     Queens

  building_code  phone_number    fax_number  grade_span_min  grade_span_max  \
0          K540  718-373-6400  718-266-4385             9.0              12
1          K293  718-694-9741  718-694-9745             6.0              12
2          Q520  718-392-3433  718-392-3443             9.0              12
3          M043  212-234-3102  212-234-8597             9.0              12
4          Q465  718-471-2154  718-471-2890             9.0              12

   expgrade_span_min  expgrade_span_max  ... priority08 priority09 priority10  \
0                NaN                NaN  ...        NaN        NaN        NaN
1                NaN                NaN  ...        NaN        NaN        NaN
2                NaN                NaN  ...        NaN        NaN        NaN
3                NaN                NaN  ...        NaN        NaN        NaN
4                NaN                NaN  ...        NaN        NaN        NaN

                                          Location 1 Community Board  \
0  50 Avenue\nX Brooklyn, NY 11223\n(40.589238098...            13.0
1  284 Baltic Street\nBrooklyn, NY 11201\n(40.685...             6.0
2  45 35 Van Dam Street\nLong Island City, NY 111...             2.0
3  509 West 129 Street\nNew York, NY 10027\n(40.8...             9.0
4  8 21 Bay 25 Street\nFar Rockaway, NY 11691\n(4...            14.0

   Council District Census Tract        BIN           BBL  \
0              47.0        308.0  3194998.0  3.071850e+09
1              33.0         69.0  3006401.0  3.004020e+09
2              26.0        179.0  4003442.0  4.002490e+09
3               7.0        219.0  1059723.0  1.019840e+09
4              31.0     100802.0  4300730.0  4.157360e+09

                                                 NTA
0  Gravesend                                     ...
1  DUMBO-Vinegar Hill-Downtown Brooklyn-Boerum Hi...
2  Hunters Point-Sunnyside-West Maspeth          ...
3  Manhattanville                                ...
4  Far Rockaway-Bayswater                        ...

[5 rows x 64 columns]
      DBN                                    SCHOOL NAME  \
0  01M292  HENRY STREET SCHOOL FOR INTERNATIONAL STUDIES
1  01M448            UNIVERSITY NEIGHBORHOOD HIGH SCHOOL
2  01M450                     EAST SIDE COMMUNITY SCHOOL
3  01M458                      FORSYTH SATELLITE ACADEMY
4  01M509                        MARTA VALLE HIGH SCHOOL

  Num of SAT Test Takers SAT Critical Reading Avg. Score SAT Math Avg. Score  \
0                     29                             355                 404
1                     91                             383                 423
2                     70                             377                 402
3                      7                             414                 401
4                     44                             390                 433

  SAT Writing Avg. Score
0                    363
1                    366
2                    370
3                    359
4                    384


   #### Read in survey_all.txt.
   ####    Use the pandas.read_csv() function to read survey_all.txt into the variable all_survey. Recall that this file is located in the schools folder.
   ####        Specify the keyword argument delimiter="\t".
   ####        Specify the keyword argument encoding="windows-1252".
  ####   Read in survey_d75.txt.
  ####      Use the pandas.read_csv() function to read schools/survey_d75.txt into the variable d75_survey. Recall that this file is located in the schools folder.
   ####        Specify the keyword argument delimiter="\t".
   ####        Specify the keyword argument encoding="windows-1252".
   #### Combine d75_survey and all_survey into a single dataframe.
   ####     Use the pandas concat() function with the keyword argument axis=0 to combine d75_survey and all_survey into the dataframe survey.
   ####     Pass in all_survey first, then d75_survey when calling the pandas.concat() function.
   #### Display the first five rows of survey using the pandas.DataFrame.head() function.

In [4]:
# reading survey_all.txt and survey_d75.txt files into Dataframes
all_survey = pd.read_csv("C:/Users/STELLAS MFB IT/Desktop/p/schools/survey_all.txt",delimiter = "\t",encoding = "windows-1252")
d75_survey = pd.read_csv("C:/Users/STELLAS MFB IT/Desktop/p/schools/survey_d75.txt",delimiter = "\t",encoding = "windows-1252")

In [5]:
# combining the two files into a single dataframe.
survey = pd.concat([all_survey,d75_survey],axis = 0,sort = True)
# display 5 rows of the combined file
survey.head()

,N_p,N_s,N_t,aca_p_11,aca_s_11,aca_t_11,aca_tot_11,bn,com_p_11,com_s_11,...,t_q8c_1,t_q8c_2,t_q8c_3,t_q8c_4,t_q9,t_q9_1,t_q9_2,t_q9_3,t_q9_4,t_q9_5
0,90.0,NaN,22.0,7.8,NaN,7.9,7.9,M015,7.6,NaN,...,29.0,67.0,5.0,0.0,NaN,5.0,14.0,52.0,24.0,5.0
1,161.0,NaN,34.0,7.8,NaN,9.1,8.4,M019,7.6,NaN,...,74.0,21.0,6.0,0.0,NaN,3.0,6.0,3.0,78.0,9.0
2,367.0,NaN,42.0,8.6,NaN,7.5,8.0,M020,8.3,NaN,...,33.0,35.0,20.0,13.0,NaN,3.0,5.0,16.0,70.0,5.0
3,151.0,145.0,29.0,8.5,7.4,7.8,7.9,M034,8.2,5.9,...,21.0,45.0,28.0,7.0,NaN,0.0,18.0,32.0,39.0,11.0
4,90.0,NaN,23.0,7.9,NaN,8.1,8.0,M063,7.9,NaN,...,59.0,36.0,5.0,0.0,NaN,10.0,5.0,10.0,60.0,15.0


  ####  Copy the data from the dbn column of survey into a new column in survey called DBN.
  ####  Filter survey so it only contains the columns we listed above. You can do this using pandas.DataFrame.loc[].
  ####      Remember that we renamed dbn to DBN; be sure to change the list of columns we want to keep accordingly.
  ####  Assign the dataframe survey to the key survey in the dictionary data.
  ####  When you're finished, the value in data["survey"] should be a dataframe with 23 columns and 1702 rows.

In [6]:
# create a new column called 'DBN' and copy column 'dbn' into it
survey['DBN'] = survey['dbn']

# create a list of the columns to filter
survey_fields = [
    "DBN", 
    "rr_s", 
    "rr_t", 
    "rr_p", 
    "N_s", 
    "N_t", 
    "N_p", 
    "saf_p_11", 
    "com_p_11", 
    "eng_p_11", 
    "aca_p_11", 
    "saf_t_11", 
    "com_t_11", 
    "eng_t_11", 
    "aca_t_11", 
    "saf_s_11", 
    "com_s_11", 
    "eng_s_11", 
    "aca_s_11", 
    "saf_tot_11", 
    "com_tot_11", 
    "eng_tot_11", 
    "aca_tot_11",
]

# filter the columns
survey = survey.loc[:,survey_fields]

# add the filtered data to the data dictionary
data["survey"] = survey

survey.head()

,DBN,rr_s,rr_t,rr_p,N_s,N_t,N_p,saf_p_11,com_p_11,eng_p_11,...,eng_t_11,aca_t_11,saf_s_11,com_s_11,eng_s_11,aca_s_11,saf_tot_11,com_tot_11,eng_tot_11,aca_tot_11
0,01M015,NaN,88,60,NaN,22.0,90.0,8.5,7.6,7.5,...,7.6,7.9,NaN,NaN,NaN,NaN,8.0,7.7,7.5,7.9
1,01M019,NaN,100,60,NaN,34.0,161.0,8.4,7.6,7.6,...,8.9,9.1,NaN,NaN,NaN,NaN,8.5,8.1,8.2,8.4
2,01M020,NaN,88,73,NaN,42.0,367.0,8.9,8.3,8.3,...,6.8,7.5,NaN,NaN,NaN,NaN,8.2,7.3,7.5,8.0
3,01M034,89.0,73,50,145.0,29.0,151.0,8.8,8.2,8.0,...,6.8,7.8,6.2,5.9,6.5,7.4,7.3,6.7,7.1,7.9
4,01M063,NaN,100,60,NaN,23.0,90.0,8.7,7.9,8.1,...,7.8,8.1,NaN,NaN,NaN,NaN,8.5,7.6,7.9,8.0


  ####  Copy the dbn column in hs_directory into a new column called DBN.
 ####   Create a new column called padded_csd in the class_size data set.
  ####      Use the pandas.Series.apply() method along with a custom function to generate this column.
  ####          Make sure to apply the function along the data["class_size"]["CSD"] column.
  ####  Use the addition operator (+) along with the padded_csd and SCHOOL CODE columns of class_size, then assign the result to the DBN column of class_size.
 ####   Display the first few rows of class_size to double check the DBN column.

In [7]:
# create a new column 'DBN' in dataset hs_directory and copy column 'dbn' into it.
data['hs_directory']['DBN'] = data['hs_directory']['dbn']

# create a function that will cnvert a number to string and pad it with zero if it is less and 2
def pad_csd(num):
    return str(num).zfill(2)

# apply the function to column 'CSD' in class_size and assign the result to column 'padded_csd'
data['class_size']['padded_csd']= data['class_size']['CSD'].apply(pad_csd)

#combine column 'padded_csd' and 'SCHOOL CODE' in class_size dataset and assign the result to column 'DBN'
data['class_size']['DBN'] = data['class_size']['padded_csd']+ data['class_size']['SCHOOL CODE']

data['class_size'].head()

,CSD,BOROUGH,SCHOOL CODE,SCHOOL NAME,GRADE,PROGRAM TYPE,CORE SUBJECT (MS CORE and 9-12 ONLY),CORE COURSE (MS CORE and 9-12 ONLY),SERVICE CATEGORY(K-9* ONLY),NUMBER OF STUDENTS / SEATS FILLED,NUMBER OF SECTIONS,AVERAGE CLASS SIZE,SIZE OF SMALLEST CLASS,SIZE OF LARGEST CLASS,DATA SOURCE,SCHOOLWIDE PUPIL-TEACHER RATIO,padded_csd,DBN
0,1,M,M015,P.S. 015 Roberto Clemente,0K,GEN ED,-,-,-,19.0,1.0,19.0,19.0,19.0,ATS,NaN,01,01M015
1,1,M,M015,P.S. 015 Roberto Clemente,0K,CTT,-,-,-,21.0,1.0,21.0,21.0,21.0,ATS,NaN,01,01M015
2,1,M,M015,P.S. 015 Roberto Clemente,01,GEN ED,-,-,-,17.0,1.0,17.0,17.0,17.0,ATS,NaN,01,01M015
3,1,M,M015,P.S. 015 Roberto Clemente,01,CTT,-,-,-,17.0,1.0,17.0,17.0,17.0,ATS,NaN,01,01M015
4,1,M,M015,P.S. 015 Roberto Clemente,02,GEN ED,-,-,-,15.0,1.0,15.0,15.0,15.0,ATS,NaN,01,01M015


  ####  Convert the SAT Math Avg. Score, SAT Critical Reading Avg. Score, and SAT Writing Avg. Score columns in the sat_results data set from the object (string) data type to a numeric data type.
 ####       Use the pandas.to_numeric() function on each of the columns, and assign the result back to the same column.
 ####       Pass in the keyword argument errors="coerce".
 ####   Create a column called sat_score in sat_results that holds the combined SAT score for each student.
 ####       Add up SAT Math Avg. Score, SAT Critical Reading Avg. Score, and SAT Writing Avg. Score, and assign the total to the sat_score column of sat_results.
 ####   Display the first few rows of the sat_score column of sat_results to verify that everything went okay.

In [9]:
# Create a list of the three columns
cols = ['SAT Math Avg. Score','SAT Critical Reading Avg. Score','SAT Writing Avg. Score']

#loop through the list and convert each element to numeric
for c in cols:
    data['sat_results'][c] = pd.to_numeric(data['sat_results'][c], errors = "coerce")
    
#Add up the scores and assgn them to a new created column called sat_score in sat_results
data['sat_results']['sat_score'] = data['sat_results'][cols[0]] + data['sat_results'][cols[1]] + data['sat_results'][cols[2]]

print(data['sat_results']['sat_score'].head())

0    1122.0
1    1172.0
2    1149.0
3    1174.0
4    1207.0
Name: sat_score, dtype: float64